In [4]:
import seaborn as sb
d1 = sb.load_dataset('titanic')
print(d1.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [6]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [7]:
d1.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
dic1 = {1:["one"], 2:["two"]}
import pandas as pd 
f1 = pd.DataFrame.from_dict(dic1)
f2 = pd.DataFrame(dic1)

In [7]:
print(f1)
print(f2)

     1    2
0  one  two
     1    2
0  one  two

In [17]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Age': [25, np.nan],
    'City': ['', 'LA']
})

print(df)
df2 = df.dropna()
print(df2)

    Name   Age City
0  Alice  25.0
1    Bob   NaN   LA
    Name   Age City
0  Alice  25.0

In [93]:
df2 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kamal","anil"]
})


df3 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})
print(df2)
print(df3)
#print(pd.merge(df2, df3, on="Name", how="inner"))
df4 = pd.concat([df2,df3], axis=1)
print("concatinated \n", df4)
df5 = df4.drop_duplicates()
print("Dropped duplicates\n", df5)

   Math  Science   Name
0    80       85  kamal
1    90       95   anil
   Math  Science   Name
0    60       65  kamal
1    90       95   anil
concatinated
    Math  Science   Name  Math  Science   Name
0    80       85  kamal    60       65  kamal
1    90       95   anil    90       95   anil
Dropped duplicates
    Math  Science   Name  Math  Science   Name
0    80       85  kamal    60       65  kamal
1    90       95   anil    90       95   anil

In [102]:
d1 = {"Name":["a","a","b"], "Rank":[1,1,2]}
df = pd.DataFrame(d1)
print(df.duplicated())
df.drop_duplicates()

0    False
1     True
2    False
dtype: bool

  Name  Rank
0    a     1
2    b     2

In [112]:
d1 = {"Name":["a","a",None], "Rank":[1,1,2]}
df1 = pd.DataFrame(d1)
df1.columns = ["id", "rank"]
df1.rename(columns={"rank":"Tank"})
print(df1)
df2 = df1.dropna()
print(df2)

     id  rank
0     a     1
1     a     1
2  None     2
  id  rank
0  a     1
1  a     1

In [106]:
df1.replace(1,100)

  id  rank
0  a   100
1  a   100
2  b     2

In [115]:
d1 = {"Name":["a","a",None], "Rank":[1,1,2]}
df1 = pd.DataFrame(d1)
df1.isnull().sum()

Name    1
Rank    0
dtype: int64

In [130]:
df2 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kamal","anil"]
})


df3 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})

df1 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})

df4 = pd.concat([df2, df3, df1]).reset_index()
print(df4)

df4.drop(columns=['index'])

   index  Math  Science   Name
0      0    80       85  kamal
1      1    90       95   anil
2      0    60       65  kamal
3      1    90       95   anil
4      0    60       65  kamal
5      1    90       95   anil

   Math  Science   Name
0    80       85  kamal
1    90       95   anil
2    60       65  kamal
3    90       95   anil
4    60       65  kamal
5    90       95   anil

In [132]:
df2.apply()

TypeError: DataFrame.apply() missing 1 required positional argument: 'func'

In [137]:
val = df2.min(numeric_only=True)
print(val)

Math       80
Science    85
dtype: int64

In [152]:
import numpy as np
#df2 = df2.apply(lambda col: np.sqrt(col) if np.issubdtype(col.dtype, np.number) else col)
df2 = df2.apply(lambda col: np.sqrt(col) if np.issubdtype(col.dtype, np.number) else col)

print(df2)

       Math   Science   Name
0  1.729363  9.219544  kamal
1  1.755013  9.746794   anil

In [ ]:
import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan', 'Feb'],
    'Salary': [3000, 3200, 4000, 4100, 5000, 5100]
}


pd.pivot(data,

In [154]:
import pandas as pd

arrays = [['Fruit', 'Fruit', 'Veg'], ['Apple', 'Banana', 'Carrot']]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'Item'))
df = pd.DataFrame({'Price': [100, 80, 60]}, index=index)

print(df)

                 Price
Category Item
Fruit    Apple     100
         Banana     80
Veg      Carrot     60

In [159]:
import pandas as pd

# Sample data
data = {
    'Region': ['East', 'East', 'West', 'South', 'West', 'South', 'East'],
    'Sales': [100, 200, 150, 300, 250, 100, 50]
}

# Create DataFrame
df = pd.DataFrame(data)
print(df)

print(df.groupby("Region")["Sales"].agg(['sum', 'mean']))

  Region  Sales
0   East    100
1   East    200
2   West    150
3  South    300
4   West    250
5  South    100
6   East     50
        sum        mean
Region
East    350  116.666667
South   400  200.000000
West    400  200.000000

In [ ]:
import pandas as pd

# Sample data
data = {
    'Region': ['East', 'East', 'West', 'South', 'West', 'South', 'East'],
    'Sales': [100, 200, 150, 300, 250, 100, 50]
}

# Create DataFrame
df = pd.DataFrame(data)

In [172]:
import pandas as pd

# Sample data
data = {
    'CustomerID': [101, 102, 101, 103, 102, 104, 101, 104, 105],
    'Purchase': [400, 600, 300, 200, 500, 800, 400, 300, 100],
    'rank': range(9)
}

# Create DataFrame
df = pd.DataFrame(data)
print(df)

   CustomerID  Purchase  rank
0         101       400     0
1         102       600     1
2         101       300     2
3         103       200     3
4         102       500     4
5         104       800     5
6         101       400     6
7         104       300     7
8         105       100     8

In [175]:
import pandas as pd

# Sample data
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance', 'HR', 'IT', 'Finance'],
    'Month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan', 'Feb', 'Mar', 'Mar', 'Mar'],
    'Expense': [2000, 2500, 3000, 3500, 4000, 3000, 1500, 2000, 3500]
}

# Create DataFrame
df = pd.DataFrame(data)
print(df)
# Pivot table
pivot_df = df.pivot_table(index='Department', columns='Month', values='Expense', aggfunc='sum')

  Department Month  Expense
0         HR   Jan     2000
1         HR   Feb     2500
2         IT   Jan     3000
3         IT   Feb     3500
4    Finance   Jan     4000
5    Finance   Feb     3000
6         HR   Mar     1500
7         IT   Mar     2000
8    Finance   Mar     3500

In [181]:
df2 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kamal","anil"]
})


df3 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})

print(df2)
print(df3)

final = pd.merge(df2, df3, how="outer") # how = "inner", "outer", on=ColunmName
print(final)

   Math  Science   Name
0    80       85  kamal
1    90       95   anil
   Math  Science   Name
0    60       65  kamal
1    90       95   anil
   Math  Science   Name
0    60       65  kamal
1    80       85  kamal
2    90       95   anil

In [182]:
df4 = df2+df3
print(df4)

   Math  Science        Name
0   140      150  kamalkamal
1   180      190    anilanil

In [183]:
l1 = [1,2,3]
l2 = [5,6,7]
l3 = l1+l2
print(l3)

[1, 2, 3, 5, 6, 7]

In [185]:
df2 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kamal","anil"]
})


df3 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})

print(df2)
print(df3)

final = pd.merge(df2, df3, how="inner", on=["Science", "Name"]) # how = "inner", "outer", on=ColunmName
print(final)

   Math  Science   Name
0    80       85  kamal
1    90       95   anil
   Math  Science   Name
0    60       65  kamal
1    90       95   anil
   Math_x  Science  Name  Math_y
0      90       95  anil      90

In [187]:
df1 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kamal","anil"]
})


df2 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})


df3 = pd.concat([df1,df2]) # axis = 0 Row
print(df3)

df4 = pd.concat([df1,df2], axis = 1) # Column
print(df4)

   Math  Science   Name
0    80       85  kamal
1    90       95   anil
0    60       65  kamal
1    90       95   anil
   Math  Science   Name  Math  Science   Name
0    80       85  kamal    60       65  kamal
1    90       95   anil    90       95   anil

In [193]:
import numpy as np
df1 = pd.DataFrame({
    'Math': [80, np.nan],
    'Science': [85, 95],
    "Name":[None,"anil"]
})
# nan: not 

print(df1)
df2 = df1.dropna()
print(df2)

   Math  Science  Name
0  80.0       85  None
1   NaN       95  anil
Empty DataFrame
Columns: [Math, Science, Name]
Index: []

In [197]:
import numpy as np
df1 = pd.DataFrame({
    'Math': [80, np.nan],
    'Science': [85, 95],
    "Name":["kaml123","anil234"]
})
print(df1)

df2 = df1.rename(columns={"Name":"ID"})
print(df2)

df1.columns = ["Math",  "Science",    "ID"]
print(df1)

   Math  Science     Name
0  80.0       85  kaml123
1   NaN       95  anil234
   Math  Science       ID
0  80.0       85  kaml123
1   NaN       95  anil234

ValueError: Length mismatch: Expected axis has 3 elements, new values have 2 elements

In [198]:
import numpy as np
df1 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kaml123","anil234"]
})
print(df1)

df2 = df1[df1["Math"]>80]
print(df2)

   Math  Science     Name
0    80       85  kaml123
1    90       95  anil234
   Math  Science     Name
1    90       95  anil234

In [205]:
import numpy as np
df1 = pd.DataFrame({
    'Math': [np.nan, 90],
    'Science': [85, 95],
    "Name":["kaml123",None]
})

print(df1.isnull().sum())
df1.info()

Math       1
Science    0
Name       1
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Math     1 non-null      float64
 1   Science  2 non-null      int64
 2   Name     1 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 180.0+ bytes

In [206]:
df1 = pd.DataFrame({
    'Math': [80, 90],
    'Science': [85, 95],
    "Name":["kamal","anil"]
})


df2 = pd.DataFrame({
    'Math': [60, 90],
    'Science': [65, 95],
    "Name":["kamal","anil"]
})